PinguinoIDE/pinguino-compilers/win32/p8/share/gputils/header/p18f97j60.inc
;----- EFLOCON Bits -----------------------------------------------------
FCEN0            EQU  H'0000'
FCEN1            EQU  H'0001'
FULDPXS          EQU  H'0002'


;----- MACON1 Bits -----------------------------------------------------
MARXEN           EQU  H'0000'
PASSALL          EQU  H'0001'
RXPAUS           EQU  H'0002'
TXPAUS           EQU  H'0003'


;----- MACON3 Bits -----------------------------------------------------
FULDPX           EQU  H'0000'
FRMLNEN          EQU  H'0001'
HFRMEN           EQU  H'0002'
PHDREN           EQU  H'0003'
TXCRCEN          EQU  H'0004'
PADCFG0          EQU  H'0005'
PADCFG1          EQU  H'0006'
PADCFG2          EQU  H'0007'



;----- MACON4 Bits -----------------------------------------------------
DEFER            EQU  H'0006'


;----- MABBIPG Bits -----------------------------------------------------
BBIPG0           EQU  H'0000'
BBIPG1           EQU  H'0001'
BBIPG2           EQU  H'0002'
BBIPG3           EQU  H'0003'
BBIPG4           EQU  H'0004'
BBIPG5           EQU  H'0005'
BBIPG6           EQU  H'0006'


;----- MICMD Bits -----------------------------------------------------
MIIRD            EQU  H'0000'
MIISCAN          EQU  H'0001'


;----- ERXFCON Bits -----------------------------------------------------
BCEN             EQU  H'0000'
MCEN             EQU  H'0001'
HTEN             EQU  H'0002'
MPEN             EQU  H'0003'
PMEN             EQU  H'0004'
CRCEN            EQU  H'0005'
ANDOR            EQU  H'0006'
UCEN             EQU  H'0007'


;----- EIE Bits -----------------------------------------------------
RXERIE           EQU  H'0000'
TXERIE           EQU  H'0001'
TXIE_EIE         EQU  H'0003'
LINKIE           EQU  H'0004'
DMAIE            EQU  H'0005'
PKTIE            EQU  H'0006'

ETXIE            EQU  H'0003'


;----- ESTAT Bits -----------------------------------------------------
PHYRDY           EQU  H'0000'
TXABRT           EQU  H'0001'
RXBUSY           EQU  H'0002'
BUFER            EQU  H'0006'


;----- ECON2 Bits -----------------------------------------------------
ETHEN            EQU  H'0005'
PKTDEC           EQU  H'0006'
AUTOINC          EQU  H'0007'


;----- EIR Bits -----------------------------------------------------
RXERIF           EQU  H'0000'
TXERIF           EQU  H'0001'
TXIF_EIR         EQU  H'0003'
LINKIF           EQU  H'0004'
DMAIF            EQU  H'0005'
PKTIF            EQU  H'0006'


;----- EDATA Bits -----------------------------------------------------
EDATA0           EQU  H'0000'
EDATA1           EQU  H'0001'
EDATA2           EQU  H'0002'
EDATA3           EQU  H'0003'
EDATA4           EQU  H'0004'
EDATA5           EQU  H'0005'
EDATA6           EQU  H'0006'
EDATA7           EQU  H'0007'


;----- SSP2CON2 Bits -----------------------------------------------------
SEN              EQU  H'0000'
RSEN             EQU  H'0001'
PEN              EQU  H'0002'
RCEN             EQU  H'0003'
ACKEN            EQU  H'0004'
ACKDT            EQU  H'0005'
ACKSTAT          EQU  H'0006'
GCEN             EQU  H'0007'

ADMSK1           EQU  H'0001'
ADMSK2           EQU  H'0002'
ADMSK3           EQU  H'0003'
ADMSK4           EQU  H'0004'
ADMSK5           EQU  H'0005'


SEN2             EQU  H'0000'
RSEN2            EQU  H'0001'
PEN2             EQU  H'0002'
RCEN2            EQU  H'0003'
ACKEN2           EQU  H'0004'
ACKDT2           EQU  H'0005'
ACKSTAT2         EQU  H'0006'
GCEN2            EQU  H'0007'

ADMSK12          EQU  H'0001'
ADMSK22          EQU  H'0002'
ADMSK32          EQU  H'0003'
ADMSK42          EQU  H'0004'
ADMSK52          EQU  H'0005'


;----- SSP2CON1 Bits -----------------------------------------------------
CKP              EQU  H'0004'
SSPEN            EQU  H'0005'
SSPOV            EQU  H'0006'
WCOL             EQU  H'0007'

SSPM0            EQU  H'0000'
SSPM1            EQU  H'0001'
SSPM2            EQU  H'0002'
SSPM3            EQU  H'0003'

SSPM02           EQU  H'0000'
SSPM12           EQU  H'0001'
SSPM22           EQU  H'0002'
SSPM32           EQU  H'0003'
CKP2             EQU  H'0004'
SSPEN2           EQU  H'0005'
SSPOV2           EQU  H'0006'
WCOL2            EQU  H'0007'


;----- SSP2STAT Bits -----------------------------------------------------
BF               EQU  H'0000'
UA               EQU  H'0001'
R_NOT_W          EQU  H'0002'
S                EQU  H'0003'
P                EQU  H'0004'
D_NOT_A          EQU  H'0005'
CKE              EQU  H'0006'
SMP              EQU  H'0007'

R_W              EQU  H'0002'
D_A              EQU  H'0005'

I2C_READ         EQU  H'0002'
I2C_START        EQU  H'0003'
I2C_STOP         EQU  H'0004'
I2C_DAT          EQU  H'0005'

NOT_W            EQU  H'0002'
NOT_A            EQU  H'0005'

NOT_WRITE        EQU  H'0002'
NOT_ADDRESS      EQU  H'0005'

READ_WRITE       EQU  H'0002'
DATA_ADDRESS     EQU  H'0005'

R                EQU  H'0002'
D                EQU  H'0005'

BF2              EQU  H'0000'
UA2              EQU  H'0001'
RW2              EQU  H'0002'
START2           EQU  H'0003'
STOP2            EQU  H'0004'
DA2              EQU  H'0005'
CKE2             EQU  H'0006'
SMP2             EQU  H'0007'


;----- ECCP2DEL Bits -----------------------------------------------------
PRSEN            EQU  H'0007'

PDC0             EQU  H'0000'
PDC1             EQU  H'0001'
PDC2             EQU  H'0002'
PDC3             EQU  H'0003'
PDC4             EQU  H'0004'
PDC5             EQU  H'0005'
PDC6             EQU  H'0006'

P2DC0            EQU  H'0000'
P2DC1            EQU  H'0001'
P2DC2            EQU  H'0002'
P2DC3            EQU  H'0003'
P2DC4            EQU  H'0004'
P2DC5            EQU  H'0005'
P2DC6            EQU  H'0006'
P2RSEN           EQU  H'0007'


;----- ECCP2AS Bits -----------------------------------------------------
ECCPASE          EQU  H'0007'

PSSBD0           EQU  H'0000'
PSSBD1           EQU  H'0001'
PSSAC0           EQU  H'0002'
PSSAC1           EQU  H'0003'
ECCPAS0          EQU  H'0004'
ECCPAS1          EQU  H'0005'
ECCPAS2          EQU  H'0006'

PSS2BD0          EQU  H'0000'
PSS2BD1          EQU  H'0001'
PSS2AC0          EQU  H'0002'
PSS2AC1          EQU  H'0003'
ECCP2AS0         EQU  H'0004'
ECCP2AS1         EQU  H'0005'
ECCP2AS2         EQU  H'0006'
ECCP2ASE         EQU  H'0007'


